Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: ཁང་པ་བརྩེགས་པ་དེའི་ནང་དུ་སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་ན་གསེར་གྱི་ས་ལེ་སྦྲམ་རིགས་དང་ལྡན་པ་རིན་པོ་ཆེ་བཻ་དཱུརྱས་བརྒྱན་པ་ལྟར་ཤིན་ཏུ་མཛེས་པར་གྱུར་ཏོ།
en: As he sat with crossed legs inside that peaked structure, he was exceedingly beautiful. He appeared to have a golden hue, shining like refined gold adorned with precious beryl.

source: །བྱང་ཆུབ་སེམས་དཔའི་མས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་རུམ་ན་འདུག་པ་མཐོང་བར་གྱུར་ཏོ།
en: The mother of the Bodhisattva could also see the Bodhisattva within her womb.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་སྤྲིན་གྱི་ཚོགས་ཆེན་པོའི་ནང་ནས་གློག་བྱུང་བ་ནི་སྣང་བ་ཆེན་པོ་སྐྱེད་དོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་འདུག་པ་ཡང་དཔལ་དང་། གཟི་བརྗིད་དང་། ཁ་དོག་གིས་ཉེ་བར་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་དང་པོ་དེ་སྣང་བར་བྱེད་དོ།
en: In the same way that a lightning bolt illumines everything as it emerges from a mass of clouds, so the Bodhisattva dwelling in his mother’s womb also illuminated the innermost chamber of the precious temple through his splendor, brilliance, and color.

source: །སྣང་བར་བྱས་ནས་སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པ་གཉིས་པ་སྣང་བར་བྱེད་དོ།
en: When that was illuminated, he illuminated the middle chamber of the fragrant temple.

source: །སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པ་གཉིས་པ་སྣང་བར་བྱས་ནས།
en: When the second level of the fragrant temple was illuminated, the light went farther and illuminated the outer chamber of the fragrant temple.

source: སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པ་གསུམ་པ་སྣང་བར་བྱེད་དོ། །སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པ་གསུམ་པ་སྣང་བར་བྱས་ནས་མའི་ལུས་ཐམས་ཅད་སྣང་བར་བྱེད་དོ།
en: Then, as the third level of the fragrant temple was bathed in light, his mother’s entire body became filled with light.

source: །དེ་སྣང་བར་བྱས་ནས་དེ་སྟན་གང་ལ་འདུག་པ་དེ་སྣང་བར་བྱེད་དོ།
en: The light then went farther and illuminated the seat upon which his mother was seated.

source: །དེ་སྣང་བར་བྱས་ནས་ཁྱིམ་ཐམས་ཅད་སྣང་བར་བྱེད་དོ།
en: Gradually the light streamed forth and brightened the entire palace.

source: །ཁྱིམ་ཐམས་ཅད་སྣང་བར་བྱས་ནས་འོད་འཕྲོ་བ་ཁྱིམ་གྱི་སྟེང་དུ་བྱུང་སྟེ། ཤར་ཕྱོགས་སྣང་བར་བྱེད་དོ།
en: The light rays rose beyond the palace and illuminated the east.

source: །དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། འོག་དང་། སྟེང་དང་། ཕྱོགས་བཅུ་ཀུན་ཏུ་རྒྱང་གྲགས་ཙམ་དུ་ཕྱོགས་རེ་རེར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་འདུག་པའི་དཔལ་དང་གཟི་བརྗིད་དང་ཁ་དོག་གིས་སྣང་བར་བྱས་པར་གྱུར་ཏོ།
en: Likewise, while the Bodhisattva was residing in the womb of his mother, the glory, brilliance, and color of the Bodhisattva illuminated the south, the west, and the north, below and above. In fact all the ten directions were bathed in light for several miles in each direction.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་བལྟ་བ་དང་། དེ་ལ་ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་ཆོས་མཉན་པའི་ཕྱིར་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་གནོད་སྦྱིན་ལྔ་བརྒྱ་ཙམ་དག་དང་ལྷན་ཅིག་ཏུ་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་འོངས་ཏེ།
en: Monks, in the early morning the Four Great Kings and the twenty-eight great commanders of the yakṣas together with five hundred yakṣas arrived to meet the Bodhisattva and to offer him their respect and veneration, and also to listen to the Dharma.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔས་དེ་དག་འོངས་པར་རིག་ནས་ལག་པ་གཡས་པ་བརྐྱང་སྟེ་མཛུབ་མོ་བསྒྲེང་ནས་སྟན་སྟོན་ཏོ།
en: At that time the Bodhisattva, who was aware of their arrival, extended his right hand and pointed out their seats.

source: །འཇིག་རྟེན་སྐྱོང་བ་ལ་སོགས་པ་དེ་དག་ཀྱང་ཇི་ལྟར་བཏིང་བའི་སྟན་ལ་འཁོད་པར་གྱུར་ཏེ།
en: The guardians of the world and the other guests sat down on the arranged seats.

source: དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་འདུག་བཞིན་དུ། སྐྱེས་ཟིན་པའི་གཟུགས་དང་འདྲ་བར་ལག་པ་བསྐྱོད་ཅིང་འདེག་ལ།
en: They perceived the Bodhisattva, who was in the womb of his mother, in the form of a child who has already taken birth, extending his hand and moving it in various positions.

source: རྣམ་པར་བསྐྱོད་ཅིང་གཞོག་པ་མཐོང་ནས། དེ་དག་དགའ་མགུ་ཞིང་ཉམས་བདེ་བ་ཐོབ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་བར་གྱུར་ཏོ།
en: Upon seeing this they prostrated to the Bodhisattva and were filled with joy, devotion, and well-being.

source: །བྱང་ཆུབ་སེམས་དཔས་ཀྱང་དེ་དག་དེ་ལྟར་འཁོད་པ་མཐོང་ནས། ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན། ཡང་དག་པར་འཛིན་དུ་འཇུག །ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་དགའ་བར་བྱེད་དོ།
en: When the Bodhisattva saw that they were settled, he taught them a Dharma teaching and instructed them, inspired them, and delighted them.

source: །གང་གི་ཚེ་དེ་དག་འདོང་བར་འདོད་པར་གྱུར་པ་དེའི་ཚེ་འང་། བྱང་ཆུབ་སེམས་དཔས་དེ་དག་གི་སེམས་སེམས་ཀྱིས་རྣམ་པར་ཤེས་ནས་ལག་པ་གཡས་པ་བརྐྱང་སྟེ་དེ་དག་འདོང་བའི་བརྡ་སྟོན་ཏོ། །
en: When they wished to go, the Bodhisattva, who knew full well their thoughts, extended his right hand as a farewell greeting.

source: དེ་ལྟར་ལག་པ་བརྐྱང་སྟེ། འདོང་བའི་བརྡ་བསྟན་ནས། ཕྱིར་སྐུམ་པར་བྱེད་དེ། མ་ལ་གནོད་པ་མེད་དོ།
en: As he retracted his hand, there was no harm done to his mother.

source: །དེའི་ཚེ་རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་ཀྱང་འདི་སྙམ་དུ་བདག་ཅག་ནི་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་འདོང་བར་གནང་ངོ་སྙམ་སེམས་ཤིང་། དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་འདོང་བར་གྱུར་ཏོ།
en: The Four Great Kings understood the greeting and thought, “We have been dismissed by the Bodhisattva.” Then they circled around the Bodhisattva and his mother three times before departing.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནུབ་མོ་མི་ཉལ་ནས་ལག་པ་གཡས་པ་བརྐྱང་ཞིང་བརྐྱངས་ནས་ཀྱང་བསྐུམ་པ་དང་། བསྐུམས་ནས་ཀྱང་དྲན་ཞིང་ཤེས་བཞིན་དུ་ལག་པ་དེ་འཇོག་པའི་རྒྱུ་ནི་དེ་ཡིན་ནོ། །རྐྱེན་ནི་དེ་ཡིན་ནོ། །
en: This was the circumstance and the reason why the Bodhisattva, in the quiet of the night, would extend his right hand and draw it back. Finally he would let the hand rest while maintaining mindfulness and carefulness.

source: གཞན་ཡང་གང་གི་ཚེ་སྐྱེས་པའམ། བུད་མེད་དམ། ཁྱེའུ་འམ། བུ་མོ་སུ་ཡང་རུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་བལྟ་བའི་ཕྱིར་འོངས་པ་དེའི་ཚེ། ཐོག་མར་ནི་བྱང་ཆུབ་སེམས་དཔའ་དགའ་བར་བྱ་བ་སྨྲའོ། །དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་མ་དགའ་བར་བྱ་བ་སྨྲའོ། །
en: At other times when people came to see the Bodhisattva, be they women or men, boys or girls, he would first joyfully welcome them, and then his mother would do the same.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་འདུག་པའི་ཚེ། སྔར་དགའ་བར་བྱ་བ་སྨྲ་བ་ལ་མཁས་པར་གྱུར་ཏེ།
en: Monks, in this way the Bodhisattva became very skilled at initiating delightful salutations as he dwelt in his mother’s womb.

source: ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། མིའམ། མི་མ་ཡིན་པ་སུ་ཡང་རུང་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྔོན་དུ་དགའ་བར་བྱ་བའི་ཚིག་སྨྲ་བར་ནུས་པ་མེད་དོ།
en: There was no one, whether god, nāga, yakṣa, human, or nonhuman, who was ever able to greet the Bodhisattva first with a delightful salutation.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཐོག་མར་དགའ་བར་བྱ་བ་སྨྲ་ཞིང་དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་མ་དགའ་བར་བྱ་བ་སྨྲའོ། །དེ་ནས་སྔ་དྲོའི་དུས་ཟད་དེ།
en: Instead the Bodhisattva would initiate the salutations, and afterward the mother of the Bodhisattva would joyfully welcome the guests.

source: ཉི་མ་གུང་ལ་བབ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་བུ་མངོན་པར་འཕགས་པ། མངོན་པར་འཕགས་པ་དག་བྱང་ཆུབ་སེམས་དཔའ་བལྟ་བ་དང་། དེ་ལ་བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔས་དེ་དག་རྒྱང་རིང་པོ་ནས་འོངས་པ་མཐོང་ནས། གསེར་གྱི་མདོག་ཏུ་འདུག་པའི་ལག་པ་གཡས་པ་བརྐྱང་སྟེ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་དག་དགའ་བར་བྱེད་ཅིང་མཛུབ་མོ་བརྐྱང་སྟེ། སྟན་སྟོན་ཏོ། །
en: When the morning had passed and the noon hour arrived, Śakra, the lord of the gods, along with the most eminent gods of the Heaven of the Thirty-Three, came to meet the Bodhisattva and to offer him their respect and veneration, and also to listen to the Dharma. The Bodhisattva, who saw them coming from a distance, extended his golden-colored right hand and, to the delight of Śakra, lord of the gods, and the gods of the Heaven of the Thirty-Three, pointed out their seats.

source: དགེ་སློང་དག་དེའི་ཚེའང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱིར་བཟློག་མ་ནུས་ནས་ཇི་ལྟར་བཏིང་བའི་སྟན་དེ་དག་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། དེ་མ་ཡིན་པའི་ལྷའི་བུ་གཞན་དག་ཀྱང་འཁོད་པར་གྱུར་ཏོ།
en: Monks, at that moment Śakra, lord of the gods, was unable to resist the Bodhisattva’s request, and so he and the gods all settled down on the seats that had been arranged for them.

source: །བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟར་འཁོད་པར་རིག་ནས་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན། ཡང་དག་པར་འཛིན་དུ་འཇུག །ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་དགའ་བར་བྱེད་དོ།
en: When the Bodhisattva knew that they were settled, he taught them a Dharma teaching and instructed them, inspired them, and delighted them.

source: །བྱང་ཆུབ་སེམས་དཔས་ལག་པ་གང་དུ་བརྐྱང་བ་དེ་ལོགས་སུ་བྱང་ཆུབ་སེམས་དཔའི་མ་ཡང་ལྟ་བར་གྱུར་ཏོ།
en: In whichever direction the Bodhisattva would extend his hand, the mother of the Bodhisattva would turn to face that way.

source: །དེས་ན་ལྷ་དེ་དག་ཀྱང་འདི་སྙམ་དུ་བདག་ཅག་ནི་བྱང་ཆུབ་སེམས་དཔའ་དང་དགའ་བར་བྱ་བ་སྨྲའོ་སྙམ་མོ། །དེ་དག་རེ་རེ་ཞིང་ཡང་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་འབའ་ཞིག་ལ་སྨྲ་སྟེ། བདག་འབའ་ཞིག་ལ་དགའ་བར་བྱ་བ་སྨྲའོ་སྙམ་མོ། །
en: Then the gods reflected, “The Bodhisattva is having a heartwarming conversation with us.” And each one of them thought, “The Bodhisattva is speaking directly to me; to me alone he extends a friendly welcome.”

source: ཁང་པ་བརྩེགས་པ་དེར་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་དེ་དག་གི་གཟུགས་བརྙན་སྣང་བར་གྱུར་ཏོ།
en: All the while the images of Śakra, lord of the gods, and those of the gods of the Heaven of the Thirty-Three were reflected within the temple.

source: །ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་གནས་པའི་ལོངས་སྤྱོད་ཡོངས་སུ་དག་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་གཞན་དག་ན་མེད་དོ།
en: Thus nowhere else were the Bodhisattva’s enjoyments as perfectly pure as in the womb of his mother.

source: །དགེ་སློང་དག་གང་གི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། དེ་མ་ཡིན་པའི་ལྷའི་བུ་གཞན་དག་འདོང་བར་འདོད་པར་གྱུར་པ་དེའི་ཚེའང་བྱང་ཆུབ་སེམས་དཔས་དེ་དག་གི་སེམས་ཀྱི་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས། ལག་པ་གཡས་པ་བརྐྱང་སྟེ་དེ་དག་འདོང་བའི་བརྡ་སྟོན་ཏོ། །
en: Monks, when Śakra, lord of the gods, and the other gods wished to depart, the Bodhisattva, who knew full well their thoughts, extended his right hand as a farewell greeting.

source: བརྡ་བསྟན་ནས་ཕྱིར་བསྐུམ་པ་བྱས་ཏེ། དྲན་ཞིང་ཤེས་བཞིན་དུ་ལག་པ་བཞག་ཀྱང་མ་ལ་གནོད་པ་མེད་དོ།
en: As he retracted his hand, there was no harm done to his mother.

source: །དེའི་ཚེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། དེ་མ་ཡིན་པའི་ལྷའི་བུ་སུམ་ཅུ་རྩ་གསུམ་པ་དག་ཀྱང་འདི་སྙམ་དུ་བདག་ཅག་ནི་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་འདོད་པར་གནང་ངོ་སྙམ་དུ་སེམས་ཤིང་། དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་དོང་བར་གྱུར་ཏོ།
en: At that time Śakra, lord of the gods, and the other gods of the Heaven of the Thirty-Three reflected, “We have been dismissed by the Bodhisattva.” Then they circled around the Bodhisattva and his mother three times before departing.

source: །དགེ་སློང་དག་ཉི་མ་ཕྱེད་ཀྱི་དུས་འདས་ནས་ཕྱི་དྲོའི་དུས་ལ་བབ་པ་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ལྷའི་བུ་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། ལྷ་ཡུལ་བའི་སྙིང་ཁུའི་ཐིགས་པ་དེ་ཁྱེར་ནས་བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར།
en: Monks, noontime passed, and it was now evening when Brahmā, lord of the Sahā World, surrounded by many hundreds of thousands of gods, approached the Bodhisattva carrying a drop of the vital force of the divine realms.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་བལྟ་བ་དང་། དེ་ལ་ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འོང་བར་གྱུར་ཏོ།
en: They came to meet the Bodhisattva and to offer him their respect and veneration, and also to listen to the Dharma.

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔས་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་འཁོར་དང་བཅས་ཏེ་འོངས་པར་ཤེས་ནས། བྱང་ཆུབ་སེམས་དཔས་ཡང་གསེར་གྱི་མདོག་ཏུ་འདུག་པའི་ལག་པ་གཡས་པ་བརྐྱང་སྟེ།
en: Monks, the Bodhisattva knew that Brahmā, lord of the Sahā World, was arriving together with his retinue, and again he raised his golden-colored right hand.

source: མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ཚངས་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་ལ་དགའ་བར་བྱ་བ་སྨྲས་ཏེ། མཛུབ་མོ་བརྐྱང་ནས་སྟན་སྟོན་ཏོ།
en: He cordially greeted Brahmā, lord of the Sahā World, and those gods of the pure realms, and pointed out their seats to them.

source: །དགེ་སློང་དག་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་བཀའ་ལས་བཟློག་པར་མ་ནུས་ནས།
en: Monks, again it was not possible for Brahmā, lord of the Sahā World, to resist the Bodhisattva’s command.

source: ཇི་ལྟར་བཏིང་བའི་སྟན་དེ་དག་ལ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་ཚངས་རིས་ཀྱི་ལྷའི་བུ་གཞན་དག་ཀྱང་འཁོད་པར་གྱུར་ཏོ།
en: Thus Brahmā, lord of the Sahā World, as well as the other gods of the pure realms, settled on those seats that had been arranged.

source: །བྱང་ཆུབ་སེམས་དཔས་ལག་པ་གང་དུ་བརྐྱང་བ་དེ་ལོགས་སུ་ལྷ་མོ་སྒྱུ་འཕྲུལ་ཡང་ལྟ་བར་གྱུར་ཏོ།
en: In whichever direction the Bodhisattva would extend his hand, the mother of the Bodhisattva would turn to face that way.

source: །དེ་ལྟར་ན་ལྷ་དེ་དག་ཀྱང་བདག་ཅག་ནི་བྱང་ཆུབ་སེམས་དཔའ་དང་དགའ་བར་བྱ་བའི་གཏམ་བྱེད་དོ་སྙམ་སྟེ་ལྷའི་བུ་དེ་དག་རེ་རེ་ཞིང་ཡང་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་འབའ་ཞིག་ལ་སྨྲས་ཏེ།
en: Then the gods reflected, “The Bodhisattva is having a heartwarming conversation with us.” And each one of them thought, “The Bodhisattva is speaking directly to me;

source: བདག་འབའ་ཞིག་ལ་དགའ་བའི་གཏམ་བྱེད་དོ་སྙམ་མོ།
en: to me alone he extends a friendly welcome.”

source: །དགེ་སློང་དག་གང་གི་ཚེ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ཚངས་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་འདོང་བར་འདོད་པར་གྱུར་པ་དེའི་ཚེ་ཡང་བྱང་ཆུབ་སེམས་དཔས་དེ་དག་གི་སེམས་ཀྱི་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས་ལག་པ་གཡས་པ་བརྐྱང་སྟེ། དེ་དག་འདོང་བའི་བརྡ་སྟོན་ཏོ། །
en: Monks, when Brahmā, lord of the Sahā World, and those gods of the pure realms wished to depart, the Bodhisattva, who knew full well their thoughts, extended his right hand as a farewell greeting.

source: དེ་ལྟར་འདོང་བའི་བརྡ་བསྟན་ནས་ཕྱིར་བསྐུམ་པ་བྱས་ཏེ། དྲན་ཞིང་ཤེས་བཞིན་དུ་ལག་པ་བཞག་ཀྱང་མ་ལ་གནོད་པ་མེད་དོ།
en: As he retracted his hand with mindfulness and carefulness, there was no harm done to his mother.

source: །དེའི་ཚེ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ཚངས་རིས་ཀྱི་ལྷ་དེ་དག་ཀྱང་འདི་སྙམ་དུ་བདག་ཅག་ནི་བྱང་ཆུབ་སེམས་དཔས་ཀྱང་འདོང་བར་གནང་ངོ་སྙམ་དུ་སེམས་ཤིང་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མ་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་འདོང་བར་གྱུར་ཏོ།
en: Then Brahmā, lord of the Sahā World, and those gods of the pure realms reflected, “We have been dismissed by the Bodhisattva.” Then they circled around the Bodhisattva and his mother three times before departing.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡང་དྲན་ཞིང་ཤེས་བཞིན་དུ་ལག་པ་འཇོག་པར་གྱུར་ཏེ།
en: Finally the Bodhisattva let his hand rest while maintaining mindfulness and carefulness.

source: དགེ་སློང་དག་ཤར་ཕྱོགས་དང་། ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། འོག་དང་། སྟེང་དང་། ཕྱོགས་བཅུ་ཀུན་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་མང་པོ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བལྟ་བ་དང་། དེ་ལ་ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པ་དང་། ཆོས་ཡང་དག་པར་བརྗོད་པར་བྱ་བའི་ཕྱིར་འོང་བར་གྱུར་ཏོ།
en: Monks, from everywhere, such as the east, the south, the west, the north, above and below, many hundreds of thousands of bodhisattvas came to meet the Bodhisattva and to offer him their respect and veneration, and also to listen to the Dharma and correctly proclaim that Dharma.

source: །དེ་དག་དེ་ལྟར་འོངས་པ་དང་། བྱང་ཆུབ་སེམས་དཔས་ལུས་ལས་འོད་བཀྱེ་སྟེ། འོད་ཀྱི་བཀོད་པ་དེ་དག་སེང་གེའི་ཁྲིར་སྤྲུལ་ནས།
en: Once they had arrived, the Bodhisattva’s body began emitting light, which manifested into lion thrones.

source: དེ་ལྟར་སྤྲུལ་པའི་ཁྲི་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་འཁོད་དུ་བཅུག་སྟེ།
en: The Bodhisattva then indicated to the bodhisattvas to take their seat on these thrones.

source: དེ་དག་དེ་ལྟར་འཁོད་པར་ཤེས་ནས་འདི་ལྟ་སྟེ་ཐེག་པ་ཆེན་པོ་འདི་ཉིད་རྒྱ་ཆེར་རྣམ་པར་དབྱེ་བའི་དོན་དུ་དྲིས་ཏེ་བརྟགས་ཀྱང་སྐལ་བ་མཉམ་པའི་ལྷ་རྣམས་མ་གཏོགས་པར་གཞན་སུས་ཀྱང་དེ་དག་མ་མཐོང་སྟེ།
en: When he knew that they were settled, the Bodhisattva questioned and examined the bodhisattvas regarding the divisions pertaining to the Great Vehicle. However, with the exception of the gods who were of equal fortune, no one else perceived this.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ནུབ་མོ་མི་ཉལ་ནས་ལུས་ལས་འོད་བཀྱེ་བའི་རྒྱུ་ནི་དེ་ཡིན་ནོ། །རྐྱེན་ནི་དེ་ཡིན་ནོ།
en: Monks, this was the circumstance and the reason why the Bodhisattva projected light from his body in the quiet of the night.

source: །དགེ་སློང་དག་ལྷ་མོ་སྒྱུ་འཕྲུལ་གྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་འདུག་པའི་ཚེ། ལུས་ལྕི་བར་མ་ཚོར་ཏེ།
en: Monks, while the Bodhisattva was dwelling in the womb of his mother, Queen Māyā did not feel any heaviness in her body.

source: གཞན་དུ་ན་ཡང་བ་དང་། འཇམ་པ་དང་། བདེ་བར་ཚོར་ཞིང་ལྟོ་མི་བདེ་བའི་སྡུག་བསྔལ་གང་ཡང་མྱོང་བར་མ་གྱུར་ཏོ།
en: On the contrary she felt light, supple, and happy, and she did not experience any uncomfortable pains in her belly.

source: །འདོད་ཆགས་ཀྱིས་ཡོངས་སུ་གདུང་བའམ། ཞེ་སྡང་གིས་ཡོངས་སུ་གདུང་བའམ། གཏི་མུག་གིས་ཡོངས་སུ་གདུང་བས་ཀྱང་ཡོངས་སུ་གདུང་བར་མ་གྱུར།
en: She was not afflicted by attachment, anger, or delusion.

source: འདོད་པའི་རྣམ་པར་རྟོག་པའམ། གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པའམ། གཙེ་བའི་རྣམ་པར་རྟོག་པ་དག་ལ་ཡང་རྣམ་པར་རྟོག་པར་མ་གྱུར་ཏེ།
en: She did not entertain any desirous thoughts, nor any thoughts of ill will or harm.

source: གྲང་བའམ། ཚ་བའམ། བཀྲེས་པའམ། སྐོམ་པའམ། མུན་པའམ།
en: She neither experienced nor witnessed any heat, cold, hunger, thirst, gloom, uncleanliness, or fatigue.

source: རྡུལ་ལམ། ངལ་བ་ཚོར་བའམ། མཐོང་བར་མ་གྱུར་ཏེ། དེ་ལ་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་ཡིད་དུ་མི་འོང་བ་སྣང་བར་མ་གྱུར་ཏོ། །རྨི་ལམ་ངན་པ་ཡང་མཐོང་བར་མ་གྱུར་ཏོ།
en: No unpleasant forms, sounds, smells, tastes, or textures appeared to her, and she also had no bad dreams.

source: །དེ་ལ་བུད་མེད་ཀྱི་སྒྱུའམ། གཡོའམ། ཕྲག་དོག་གམ། བུད་མེད་ཀྱི་ཉོན་མོངས་པ་དག་ཀྱང་ཉམས་སུ་གནོད་པར་བྱེད་པར་མ་གྱུར་ཏོ།
en: There was no female deception, guile, envy, or feminine disturbing emotions to trouble her.

source: །དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་མ་ནི་བསླབ་པའི་གཞི་ལྔ་ཡང་དག་པར་བླངས་ཏེ།
en: At that time the mother of the Bodhisattva observed the five basic precepts.

source: ཚུལ་ཁྲིམས་དང་ལྡན་ཞིང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་གནས་པར་གྱུར་ཏོ།
en: She was disciplined and followed the path of the ten virtuous actions.

source: །བྱང་ཆུབ་སེམས་དཔའི་མ་ཡང་སྐྱེས་པ་གང་ལ་ཡང་འདོད་ཆགས་ཀྱི་སེམས་སྐྱེ་བར་མ་གྱུར་ལ། སྐྱེས་པ་གང་ཡང་བྱང་ཆུབ་སེམས་དཔའི་མ་ལ་འདོད་ཆགས་ཀྱི་སེམས་མི་སྐྱེའོ།
en: The mother of the Bodhisattva never desired any man whomsoever, and neither did any man feel lust in the presence of the mother of the Bodhisattva.

source: །སེར་སྐྱའི་གྲོང་ཁྱེར་ཆེན་པོ་དེ་དང་། ཡུལ་གཞན་དག་ན་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་སུ་གང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། འབྱུང་པོས་ནོན་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་མ་མཐོང་མ་ཐག་ཏུ་སོས་ཤིང་དྲན་པ་ཐོབ་པར་གྱུར་ཏོ།
en: Merely by seeing the mother of the Bodhisattva, any woman, man, boy, or girl in the city of Kapilavastu and its surrounding areas who had been possessed was cured and regained consciousness immediately, regardless of whether they had been possessed by gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, or bhūtas.

source: །མི་མ་ཡིན་པ་དེ་དག་ཀྱང་མྱུར་དུ་གནས་གཞན་དུ་འདོང་བར་གྱུར་ཏོ།
en: Those nonhuman beings quickly departed for other places.

source: །སེམས་ཅན་གང་ལ་ལ་ཞིག་ནད་སྣ་ཚོགས་ཀྱིས་ཐེབས་པར་གྱུར་ཏེ།
en: All those who had been struck by illness were freed from their disease as soon as the mother of the Bodhisattva placed her right hand on the top of their head.

source: རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་དང་། འདུས་པ་ལས་བྱུང་བའི་ནད་ཀྱིས་གནོད་པར་གྱུར་པ་དང་། མིག་གི་ནད་དམ། རྣ་བའི་ནད་དམ། སྣའི་ནད་དམ། ལྕེའི་ནད་དམ། མཆུའི་ནད་དམ། སོའི་ནད་དམ། ལྐོག་མའི་ནད་དམ། ཤུ་བའམ། འབྲས་སམ། མཛེའམ། ཤ་བཀྲའམ། སྐེམ་པའམ། བརྗེད་བྱེད་དམ། རིམས་སམ། ལྦ་བ་འམ། ཕོལ་མིག་གམ། མེ་དབལ་ལམ། རྐང་ཤུ་ལ་སོགས་པའི་ནད་ཀྱིས་བཏབ་པར་གྱུར་པ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའི་མས། ལག་པ་གཡས་པ་སྤྱི་བོར་བཞག་པ་ཙམ་གྱིས་ནད་དང་བྲལ་བར་གྱུར་ཅིང་། རང་རང་གི་གནས་སུ་འདོང་བར་གྱུར་ཏོ།
en: In this way she would cure those who suffered from any illness or ailment that arises from disharmony among wind, bile, or phlegm. She would cure illnesses related to the eyes, ears, nose, tongue, and lips, as well as toothaches, throat diseases, goiters, lumps, various forms of leprosy, tuberculosis, madness, dementia, fevers, swellings, boils, rashes, scabs, and other illnesses.

source: །ཐ་ན་ལྷ་མོ་སྒྱུ་འཕྲུལ་གྱིས་རྩྭ་ཉག་མ་འགའ་ཞིག་ས་ལས་བླངས་ཏེ་སེམས་ཅན་ནད་པ་དག་ལ་བྱིན་ཡང་དེ་དག་དེ་བླངས་མ་ཐག་ཏུ་ནད་མེད་ཅིང་ཉམས་པ་མེད་པར་གྱུར་ཏོ།
en: Once they were freed from their disease, these people could then return to their homes.

source: །གང་གི་ཚེ་ལྷ་མོ་སྒྱུ་འཕྲུལ་དེས་བདག་གི་ལྟོ་གཡས་པར་བལྟས་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་འདུག་པ་དེ་འདི་ལྟ་སྟེ་དཔེར་ན་མེ་ལོང་གི་དཀྱིལ་འཁོར་ཤིན་ཏུ་དག་པ་ལ་གདོང་གི་དཀྱིལ་འཁོར་སྣང་བ་བཞིན་ཏེ།
en: Queen Māyā would also pick herbs and distribute them to the sick, who would immediately regain their health and vigor. When Queen Māyā looked inside her belly, she saw the Bodhisattva resting on the right side of her womb. She could see this as clearly as if she was looking at her own face in a spotless mirror.

source: དེ་ལྟར་དེ་མཐོང་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་པར་གྱུར་ཏོ།
en: Seeing him in that way, she was satisfied, elated, and delighted. She felt extremely happy, buoyant, and joyful.

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་གནས་པའི་བྱིན་གྱི་རླབས་ཀྱིས། ཉིན་མཚན་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ལྷའི་རོལ་མོ་སིལ་སྙན་གྱི་སྒྲ་འབྱུང་ཞིང་ལྷའི་མེ་ཏོག་གི་ཆར་འབབ་པར་གྱུར་ཏོ། །ཆར་ནི་དུས་བཞིན་དུ་འབབ།
en: Monks, through the blessings of the Bodhisattva staying in his mother’s womb, the sounds of divine musical instruments arose constantly without interruption both day and night, and a rain of divine flowers fell.

source: རླུང་ནི་དུས་བཞིན་དུ་ལྡང་།
en: The gods sent timely rains, and the winds blew at appropriate moments.

source: དུས་དང་སྐར་མ་དག་ཀྱང་དུས་བཞིན་དུ་འགྱུར་ཞིང་འཕོ་བར་གྱུར་ཏོ།
en: The seasons and the stars all moved in a balanced manner.

source: །རྒྱལ་སྲིད་ཀྱང་བདེ་ཞིང་ལོ་ལེགས་ལ་འཁྲུག་པ་མེད་ཅིང་དགྲ་མེད་པར་གྱུར་ཏོ།
en: The kingdom was joyful and the harvests were bountiful. There were no disturbances or animosity anywhere.

source: །སེར་སྐྱའི་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ན་ཤཱཀྱའི་རིགས་དང་། སེམས་ཅན་གཞན་དག་འཁོད་པ་ཐམས་ཅད་ཀྱང་ཟ་ཞིང་འཐུང་། དགའ་ཞིང་རྩེ་ལ་དགའ་མགུར་སྤྱོད་དོ།
en: In the city of Kapilavastu, the clan of the Śākyas and everyone else had plenty to eat and drink, and they enjoyed themselves with various amusements.

source: །སྦྱིན་པ་དག་ཀྱང་གཏོང་། བསོད་ནམས་དག་ཀྱང་བྱེད་དེ།
en: They were generous and created merit.

source: ཟླ་བ་བཞི་འདས་པའི་དུས་སྟོན་བཞིན་དུ་ཐམས་ཅད་ཀྱང་དགའ་བའི་མཆོག་གིས་རྩེ་ཞིང་བདེ་བར་གནས་པས་གནས་པར་གྱུར་ཏོ།
en: They happily amused themselves just as one does during the autumn festival at the end of the fourth month.

source: །རྒྱལ་པོ་ཟས་གཙང་མ་ཡང་ཚངས་པའི་སྤྱོད་པ་ཡང་དག་པར་བླངས་ཏེ།
en: King Śuddhodana devoted himself purely to religious practice.

source: རྒྱལ་པོའི་ལས་བཏང་ནས་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་ཡོངས་སུ་དག་པ་ན་གནས་པ་བཞིན་དུ་ཐམས་ཅད་ཀྱང་དགའ་བའི་མཆོག་གིས་ཆོས་ཀྱི་རྗེས་སུ་འབྲང་བར་གྱུར་ཏོ།
en: Setting aside all his kingly work, he lived in complete purity as if he had entered an ascetic’s grove. With great delight, he followed the Dharma.

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་གནས་པ་ནི་རྣམ་པ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་དང་ལྡན་པས་གནས་པར་གྱུར་ཏོ།
en: Monks, such were the miraculous marvels that occurred while the Bodhisattva remained in his mother’s womb.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྤྱད་པ་རིན་པོ་ཆེ་བཀོད་པ་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་གནས་པའི་ཚེ་གནས་གནས་པ་མཐོང་ངམ།
en: At this time the Blessed One asked venerable Ānanda, “Ānanda, would you like to see the jeweled structure that delighted the Bodhisattva when he stayed in his mother’s womb?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ།
en: Ānanda replied, “Yes, Blessed One.

source: །བདེ་བར་གཤེགས་པ་མཐོང་ལགས་སོ།
en: I would love to, Well-Gone One!”

source: །དེ་བཞིན་གཤེགས་པས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། འཇིག་རྟེན་སྐྱོང་བ་བཞི་དང་། དེ་མ་ཡིན་པའི་ལྷ་དང་། མི་གཞན་དག་ཀྱང་བསྟན་ཏེ་མཐོང་ནས།
en: The Blessed One then showed the jeweled structure to venerable Ānanda as well as to Śakra, lord of the gods; the four guardians of the world; and many other gods and humans.

source: དེ་དག་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ།
en: As they saw the structure, they were satisfied, uplifted, and full of rejoicing.
